app/views/users/index.html.erb

  <p>
    <%= pluralize(user.articles.count, "article" )%>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]